api/app/controllers/todos_controller.rb

    def create
        todo = Todo.create(todo_params)
---
INSERT INTO "todos" ("title", "description", "status", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def index
        todo = Todo.all
---
SELECT "todos".* FROM "todos"