API/app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT "users".* FROM "users" WHERE (username = 'osedo' OR email = 'osedo@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]